Revit 2027 API
LightType.GetInitialIntensity Method
 Return a copy of an object derived from InitialIntensity
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public InitialIntensity GetInitialIntensity()
Public Function GetInitialIntensity As InitialIntensity
public:
InitialIntensity^ GetInitialIntensity()
member GetInitialIntensity : unit -> InitialIntensity
Return Value
InitialIntensity
See Also
Reference
LightType Class
Autodesk.Revit.DB.Lighting Namespace